Retro_Documentation/SOAP_Contracts/GetPriceRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="http://hp.com/ews/price/1">
  <soapenv:Header/>
  <soapenv:Body>
    <tns:GetPriceRequest>
      <request>
        <sku>SKU-1000</sku>
        <market>US</market>
        <currency>USD</currency>
        <effectiveDate>2025-01-01</effectiveDate>
      </request>
    </tns:GetPriceRequest>
  </soapenv:Body>
</soapenv:Envelope>
