Retro_Documentation/SOAP_Contracts/SubmitPriceJobRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="http://hp.com/ews/price/1">
  <soapenv:Header/>
  <soapenv:Body>
    <tns:SubmitPriceJobRequest>
      <market>US</market>
    </tns:SubmitPriceJobRequest>
  </soapenv:Body>
</soapenv:Envelope>
